_protected/frontend/controllers/AboutController.php

    protected function findModel($id)
    {
        if (($model = About::findOne($id)) !== null) {
---
SELECT * FROM `about` WHERE `id`='1'