_protected/frontend/controllers/ContactController.php

SELECT * FROM `contact` WHERE `id`=1
---
    protected function findModel($id)
    {
        if (($model = Contact::findOne($id)) !== null) {