_protected/frontend/controllers/GalleryController.php

    protected function findModel($id)
    {
        if (($model = Gallery::findOne($id)) !== null) {
---
SELECT * FROM `gallery` WHERE `id`='1'