_protected/frontend/controllers/ServiceController.php

    public function actionIndex()
    {
        $searchModel = new ServiceSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $cat = Category::find()->orderBy('name_pt')->all();
        $serv = Service::find()->orderBy('title_pt')->all();
---
SELECT * FROM `category` ORDER BY `name_pt`
SELECT * FROM `service` ORDER BY `title_pt`

    protected function findModel($id)
    {
        if (($model = Service::findOne($id)) !== null) {
---
SELECT * FROM `service` WHERE `id`='1'