_protected/frontend/controllers/SiteController.php

SELECT * FROM `category` ORDER BY `name_pt`
SELECT * FROM `service` ORDER BY `title_pt`
SELECT * FROM `campaign`
---
    public function actionIndex()
    {
        $searchModel = new ServiceSearch();
        $searchModel->promo = true;
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);


        return $this->render('tempindex',[
            'cat'=>Category::find()->orderBy('name_pt')->all(),
            'serv'=>Service::find()->orderBy('title_pt')->all(),
            'modelImg'=>Campaign::find()->one(),
            'dataProvider' => $dataProvider,
        ]);