_protected/frontend/controllers/TeamController.php

    protected function findModel($id)
    {
        if (($model = Team::findOne($id)) !== null) {
---
SELECT * FROM `team` WHERE `id`='1'